{
    "fields" : [
        "plain-text", 
        "rich-text", 
        "image", 
        "multi-image", 
        "video",
        "link", 
        "email" ,  
        "phone", 
        "number", 
        "date-time", 
        "switch", 
        "option", 
        "file", 
        "reference"
    ],
    
    "fieldsData" :{
        "collection-name" : {
            "title": "What is a Collection?",
            "desc": "<p>It's a collection  or database of items like blog, posts, projects, clients, authors, or any other type of data. After you define the structure of each item in the collection here, you'll be able to create new items. Then you can design how these items will look with Collection lists and Collection pages.</p><p></p><h5>Examples</h5><ul><li>A collection of Blogs Posts</li><li>A collection of Authors</li><li>A collection of Categories or Tags</li><li>A collection  of Projects</li><li>A collection of Clients</li><li>A collection of Team Members</li><li>A collection of Events</li><li>A collection to <em>pretty much anything...</em></li></ul><p></p><h5>Pro Tips</h5><p>You can create relationships between Collections using the Reference and/or Multi-Reference fields. For example, if you have a collection of Blogs Posts and a collections of Authors , you can choose an Author (or multiple Authors) for each Blog Post.</p>"
        },
        "collection-fields" : {
            "title": "What is a Collection's Fields?",
            "desc": "<p>Each Collection fields is a type of content (text, image, number, etc) that each Collection item should have. When your create a new item, all the fields you choose will show up as a black inputs. Once the content is added to items , the content for these fields can have referenced and designed in the Funnel Designer.</p><p></p><h5>Example</h5><p></p><p>For a collection of Blog Posts, you'll want to add fields to be used in teach blog post and in grid views on the website. Some important content for a blog post might be the body copy <strong>(Rich Text Field),</strong> summary copy for grid views<strong>(Plain Text Field)</strong>, main image <strong>(Image Field</strong>), a way to mark a blog post as <em>'Featured'</em> <strong>(Switch Field)</strong>, an author (Reference Field) and a category <strong>(Reference Field)</strong>.</p><h5>Help Text</h5><p>Add help text to fields int he Editor to guide Collaborators in filling out information.</p><h5>Field Option</h5><p>Field can be marked as <em><u>'Required'</u></em></p><h5>Slug</h5><p>The last section of a page's URL. for example, in s3pages.com/templates, templates is the slug. For the bast SEO results, keep your slugs short but clear. Only includes the item's main keywords, leaving out and 'stop' ( or 'function') words like <em>a, the, and,</em> etc.</p>"
        },
        
         "file":{
            "title": "What is a file Field?",
            "desc": "<p>This Field is the best used for basic text content that doesn't need special formatting like headings, inline styles,, or inline media like images or video. As a designer you can choose to display this fields to Collaborators as either a single-line input fields (for shorter text) or multiple-line input field (for longer text that will have many lines).</p><h5>Common Uses</h5><ul><li>Short-form text that doesn't need any styling</li><li>Names and Titles</li><li>Team Member Bios</li><li>Products Descriptions</li><li>Event Description</li><li>Category Tags</li></ul><h5>Pro Tips</h5><p>Plain Text works great when you want to limit the amount of styling the Collaborators can do - plain text doesn't allow any inline styling, so the output will remain clean/unstyled..</p>"
        },
         "reference":{
            "title": "What is a reference Field?",
            "desc": "<p>This Field is the best used for basic text content that doesn't need special formatting like headings, inline styles,, or inline media like images or video. As a designer you can choose to display this fields to Collaborators as either a single-line input fields (for shorter text) or multiple-line input field (for longer text that will have many lines).</p><h5>Common Uses</h5><ul><li>Short-form text that doesn't need any styling</li><li>Names and Titles</li><li>Team Member Bios</li><li>Products Descriptions</li><li>Event Description</li><li>Category Tags</li></ul><h5>Pro Tips</h5><p>Plain Text works great when you want to limit the amount of styling the Collaborators can do - plain text doesn't allow any inline styling, so the output will remain clean/unstyled..</p>"
        },
         "switch":{
            "title": "What is a switch Field?",
            "desc": "<p>The Switch Field is primarily a filtering tool. For example, you could create a field labelled 'Featured?' for Blog Posts, so Collaborators could choose items to showcase in a different way.</p><p>As a designer, you can filter to showcase items depending on whether or not the switch is activated. For example, you could design a separate area for Featured Blog Posts, where a Collection List would only show item that have an activated switch.</p><h5>Common Uses</h5><ul><li>To call out a specific a item or items by adding a switch for Featured (blog posts, products,services etc.)</li><li>Add a switch to Hide specific items until ready to be displayed in certain areas of your site.</li></ul><h5>Pro Tips</h5><p>Use Switches to help in filtering out the items your want to show in a Collection List.</p>"
        },
         "option":{
            "title": "What is a option Field?",
            "desc": "<p>The fiel field lets you add seceral popular file types to CMS items, which site visitors can view or download.</p><H5>Common Uses</H5><ul><li>Provide PDF versions ro menus, schedules, location  maps and more.</li><li>Provide downloadable whitePapers, case studied, ebook and many more.</li><li>Providing downloadable graphics like wallpapers, infographics and more.</li></ul><H5>Pro Tips</p><H5>The fiel field supports image file pf  up to 4MB</p><ul><li>JPG / JPEG</li><li>PNG</li><li>WebP</li><li>GIF</li><li>BMP</li><li>SVG</li></ul><p>And documents of up ro 10MB:</p><ul><li>PDF</li><li>DOC / DOCX</li><li>XLS/ XLSX</li><li>PPT/ PPTX</li><li>TXT</li><li>CSV</li><li>ODT</li><li>ODS</li><li>ODP</li></ul>"
        },
         "date-time":{
            "title": "What is a date-time Field?",
            "desc": "<p>The Field allows you to create both a date and time field, which will display itself as a date picker for Collaborators when creating an item in this collection.</p><p>As a designer you are multiple methods of displaying this data, allowing you to customize which portion of the data/time you want ro display (month, day, year - and any combination of these).</p><p>Collections Editor automatically tracks dates and times for Date Created, Date Published adn Date Modified, so no additional field would need to be created for these.</p><h5>Common Uses</h5><ul><li>A date or time in the future (upcoming evente, release date, etc.)</li><li>A date or time in the past (birthday, historical date, etc).</li></ul><h5>Pro Tips</h5><p>You can pull from the Date/Time field multiple times within your designs - allowing you to create unique layouts and options to display divided portions of a date (days, months, and years) </p>"
        },
         "number":{
            "title": "What is a number Field?",
            "desc": "<p>The Number Field is similar to Plain Text, in that it allows you to create a non-rich text field. However, this field should be used when the input is meant to be a numeric value. Collaborators can then inset an integer with or without decimals with in the Editor.</p><h5>Common Uses</h5><ul><li>Rating</li><li>Ranking</li><li>Sorting Value</li><li>Pricing / E-commerce</li></ul><h5>Pro Tip </h5><p>The number field is a great field to sort by when you want to sort a Collection List in a specific order.</p>"
        },
         "phone":{
            "title": "What is a phone Field?",
            "desc": "<p>The phone field lets you and your collaborators add phone numbers to a Collection. On the sote, you can display the phone number as text or turn it into an active links so visitors can call with a click or a tap.</p><h5>Common Uses</h5><ul><li>Phone number for a team member, cutomer service, reservation desk, etc.</li><li>Link to this phone number on the website</li></ul><h5>Pro Tip</h5><p>You can also add inline phone links with the Rich Text Field.</p>"
        },
        "link":{
            "title": "What is a link Field?",
            "desc": "<p>The link field lets you and your collaborators add URLs to a Collection. On the site, you can display a URL as a text or make it an active link so visitors can visit that URL with a click or a tap.</p><h5>Common Uses</h5><ul><li>Link to other pages or websites.</li><li>Link to third-party services (like Eventbrite for events, OpenTable for reservations, etc.)</li><li>Link to social media sites.</li></ul><h5>Pro Tip </h5><p>You can also add inline links with the Rich Text field.</p>"
        },
        "image":{
            "title": "What is a Images Field?",
            "desc": "<p>Upload images form your computer and use them as a dynamic element for your individual collection item. Collaborators can then use this image as a both a regular image element or a background image within dynamic pages and lists.</p><p>Common Uses</p><ul><li>Profile Picture for Authors or Team Members</li><li>Blog Thumbnail Images</li><li>Background Images</li><li>Icons</li></ul><p>Pro Tips</p><p>Sometimes it's best to have multiple images fields when working with different placement across your site. For example, a different image may e used on a thumbnail than the Collection Page banner background.</p>"
        },
        "video":{
            "title": "What is a Video Field?",
            "desc": "<p>Add videos via a link from an online video host like Vimeo or Youtube. Collaborators can then paste in the video link from 3rd party video sites like Vimeo directly in the Editor before publishing.</p><h5>Common Uses</h5><ul><li>Marketing Video for Landing Pages</li><li>Products Description Videos</li><li>Videos for Resource Pages(i.e. tutorial and how-to videos)</li></ul><h5>Pro Tips</h5><p>The video field will already work across all Devices, so you and your Collaborators won't have to worry about mobile responsiveness.</p>"
        },
        "multi-image":{
            "title": "What is a multi-image Field?",
            "desc": "<p>The multi-image fields lets you add up to 25 images to a single field in your Collection items, then display them in a gallery format on Collection Template pages via a Collection list.</p><p>Collaborators can add and remove images, adjust their display order and add and edit aly text in the Editor of Collection Manager.</p><p>Images must be under 4MB and of one of the following types:</p><ul><li>JPG</li><li>GIF</li><li>PNG</li><li>SVG</li></ul><h5>Common Uses</h5><ul><li>Adding image galleries to portfolio projects</li><li>Showing multiple photos of E-commerce products</li><li>Including beautiful galleries in blog posts, case studies and more</li></ul>"
        },
        "email":{
            "title": "What is a Email Field?",
            "desc": "<p>The Email field lets you and your collaborators add email addresses to a Collection. On the site, you can display an email as text or turn it into an active link so visitors can email with a click or a tap.</p><h5>Common Uses</h5><ul><li>Email address of a team member, customers service etc.</li><li>Link to this email address on the website</li></ul><h5>Pro Tip</h5><p>You can also add inline email links with the Rich Text Fields.</p>"
        },
        "rich-text":{
            "title": "What is a rich-text Field?",
            "desc": "<p>Use Rich Text for long-form cotent ro areas of the website where you and your collaborators might need multiple paragraphs, heading or inline media such as avideos, images or links. Rich text also allowes Collaborators to add further text formatting such as bold, italics and underline.</p><p>Common uses</p><ul><li>Most long-form content</li><li>Blog Posts</li><li>Articles </li><li>Team Member Bios</li><li>Products Description</li><li>Evenet Details</li></ul><p>Pro Tips</p><p>Rich text come in hanlt when you want to give Collaborators to have this ability, the Plain Text field will be the better choice.</p>"
        },
        "plain-text":{
            "title": "What is a Plain Text Field?",
            "desc": "<p>This Field is the best used for basic text content that doesn't need special formatting like headings, inline styles,, or inline media like images or video. As a designer you can choose to display this fields to Collaborators as either a single-line input fields (for shorter text) or multiple-line input field (for longer text that will have many lines).</p><h5>Common Uses</h5><ul><li>Short-form text that doesn't need any styling</li><li>Names and Titles</li><li>Team Member Bios</li><li>Products Descriptions</li><li>Event Description</li><li>Category Tags</li></ul><h5>Pro Tips</h5><p>Plain Text works great when you want to limit the amount of styling the Collaborators can do - plain text doesn't allow any inline styling, so the output will remain clean/unstyled..</p>"
        }
    }
}